// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

// 452 -> 11
// 82 -> 10
// 9012 -> 12
Console.WriteLine("Введите число: ");
string number = Convert.ToString(Console.ReadLine());
for (int i = 0; i <= number.Length; i++)
{
  Console.WriteLine(number.Length);
}

